HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxI2c_regdef.h
/** \\brief  Received Packet Size Status Register */
typedef struct _Ifx_I2C_RPSSTAT_Bits
{
    unsigned int RPS:14;                    /**< \brief [13:0] Received Packet Size (rh) */
    unsigned int reserved_14:18;            /**< \brief \internal Reserved */
} Ifx_I2C_RPSSTAT_Bits;

/** \\brief  RUN Control Register */
typedef struct _Ifx_I2C_RUNCTRL_Bits
{
    unsigned int RUN:1;                     /**< \brief [0:0] Enable I2C-bus Interface (rw) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_I2C_RUNCTRL_Bits;

/** \\brief  Reception Data Register */
typedef struct _Ifx_I2C_RXD_Bits
{
    unsigned int RXD:32;                    /**< \brief [31:0] Reception Data (rh) */
} Ifx_I2C_RXD_Bits;

/** \\brief  Timing Configuration Register */
typedef struct _Ifx_I2C_TIMCFG_Bits
{
    unsigned int SDA_DEL_HD_DAT:6;          /**< \brief [5:0] SDA Delay Stages for Data Hold Time (rw) */
    unsigned int HS_SDA_DEL_HD_DAT:3;       /**< \brief [8:6] SDA Delay Stages for Data Hold Time in High-speed Mode (rw) */
    unsigned int SCL_DEL_HD_STA:3;          /**< \brief [11:9] SCL Delay Stages for Hold Time Start (Restart) Bit (rw) */
    unsigned int reserved_12:2;             /**< \brief \internal Reserved */
    unsigned int EN_SCL_LOW_LEN:1;          /**< \brief [14:14] Enable Direct Configuration of SCL Low Period Length in Fast Mode (rw) */
    unsigned int FS_SCL_LOW:1;              /**< \brief [15:15] Set Fast Mode SCL Low Period Timing (rw) */
    unsigned int HS_SDA_DEL:3;              /**< \brief [18:16] SDA Delay Stages for Start/Stop bit in High-speed Mode (rw) */
    unsigned int reserved_19:5;             /**< \brief \internal Reserved */
    unsigned int SCL_LOW_LEN:8;             /**< \brief [31:24] SCL Low Length in Fast Mode (rw) */
} Ifx_I2C_TIMCFG_Bits;

/** \\brief  Transmit Packet Size Control Register */
typedef struct _Ifx_I2C_TPSCTRL_Bits
{
    unsigned int TPS:14;                    /**< \brief [13:0] Transmit Packet Size (rwh) */
    unsigned int reserved_14:18;            /**< \brief \internal Reserved */
} Ifx_I2C_TPSCTRL_Bits;

/** \\brief  Transmission Data Register */
typedef struct _Ifx_I2C_TXD_Bits
{
    unsigned int TXD:32;                    /**< \brief [31:0] Transmission Data (rw) */
} Ifx_I2C_TXD_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_I2c_union
 * \{  */

/** \\brief  Access Enable Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_I2C_ACCEN0_Bits B;
} Ifx_I2C_ACCEN0;

/** \\brief  Access Enable Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_I2C_ACCEN1_Bits B;
} Ifx_I2C_ACCEN1;

/** \\brief  Address Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_I2C_ADDRCFG_Bits B;
} Ifx_I2C_ADDRCFG;

/** \\brief  Bus Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_I2C_BUSSTAT_Bits B;
} Ifx_I2C_BUSSTAT;

/** \\brief  Clock Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_I2C_CLC_Bits B;
} Ifx_I2C_CLC;

/** \\brief  Clock Control 1 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_I2C_CLC1_Bits B;
} Ifx_I2C_CLC1;

/** \\brief  End Data Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_I2C_ENDDCTRL_Bits B;
} Ifx_I2C_ENDDCTRL;

/** \\brief  Error Interrupt Request Source Clear Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_I2C_ERRIRQSC_Bits B;
} Ifx_I2C_ERRIRQSC;

/** \\brief  Error Interrupt Request Source Mask Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_I2C_ERRIRQSM_Bits B;
} Ifx_I2C_ERRIRQSM;

/** \\brief  Error Interrupt Request Source Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_I2C_ERRIRQSS_Bits B;
} Ifx_I2C_ERRIRQSS;

/** \\brief  Fractional Divider Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_I2C_FDIVCFG_Bits B;
} Ifx_I2C_FDIVCFG;

/** \\brief  Fractional Divider High-speed Mode Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_I2C_FDIVHIGHCFG_Bits B;
} Ifx_I2C_FDIVHIGHCFG;

/** \\brief  Filled FIFO Stages Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_I2C_FFSSTAT_Bits B;
} Ifx_I2C_FFSSTAT;

/** \\brief  FIFO Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_I2C_FIFOCFG_Bits B;
} Ifx_I2C_FIFOCFG;

/** \\brief  General Purpose Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_I2C_GPCTL_Bits B;
} Ifx_I2C_GPCTL;

/** \\brief  Interrupt Clear Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_I2C_ICR_Bits B;
} Ifx_I2C_ICR;

/** \\brief  Module Identification Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_I2C_ID_Bits B;
} Ifx_I2C_ID;

/** \\brief  Interrupt Mask Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_I2C_IMSC_Bits B;
} Ifx_I2C_IMSC;

/** \\brief  Interrupt Set Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_I2C_ISR_Bits B;
} Ifx_I2C_ISR;

/** \\brief  Kernel Reset Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_I2C_KRST0_Bits B;
} Ifx_I2C_KRST0;

/** \\brief  Kernel Reset Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_I2C_KRST1_Bits B;
} Ifx_I2C_KRST1;

/** \\brief  Kernel Reset Status Clear Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_I2C_KRSTCLR_Bits B;
} Ifx_I2C_KRSTCLR;

/** \\brief  Masked Interrupt Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_I2C_MIS_Bits B;
} Ifx_I2C_MIS;

/** \\brief  Module Identification Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_I2C_MODID_Bits B;
} Ifx_I2C_MODID;

/** \\brief  Maximum Received Packet Size Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_I2C_MRPSCTRL_Bits B;
} Ifx_I2C_MRPSCTRL;

/** \\brief  Protocol Interrupt Request Source Clear Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_I2C_PIRQSC_Bits B;
} Ifx_I2C_PIRQSC;

/** \\brief  Protocol Interrupt Request Source Mask Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_I2C_PIRQSM_Bits B;
} Ifx_I2C_PIRQSM;

/** \\brief  Protocol Interrupt Request Source Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_I2C_PIRQSS_Bits B;
} Ifx_I2C_PIRQSS;

/** \\brief  Raw Interrupt Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_I2C_RIS_Bits B;
} Ifx_I2C_RIS;

